{
  "title": "Spontaneous fine-tuning to environment in many-species chemical reaction networks",
  "authors": [
    "Jordan M. Horowitz",
    "Jeremy L. England"
  ],
  "abstract": "<p>A chemical mixture that continually absorbs work from its environment may exhibit steady-state chemical concentrations that deviate from their equilibrium values. Such behavior is particularly interesting in a scenario where the environmental work sources are relatively difficult to access, so that only the proper orchestration of many distinct catalytic actors can power the dissipative flux required to maintain a stable, far-from-equilibrium steady state. In this article, we study the dynamics of an in silico chemical network with random connectivity in an environment that makes strong thermodynamic forcing available only to rare combinations of chemical concentrations. We find that the long-time dynamics of such systems are biased toward states that exhibit a fine-tuned extremization of environmental forcing.</p>",
  "id": "pnas.114/29/7565",
  "url": "https://www.pnas.org/content/114/29/7565",
  "pdf": "https://www.pnas.org/content/pnas/114/29/7565.full.pdf",
  "bibtex": "@article {Horowitz7565,\n   author = {Horowitz, Jordan M. and England, Jeremy L.},\n\ttitle = {Spontaneous fine-tuning to environment in many-species chemical reaction networks},\n\tvolume = {114},\n\tnumber = {29},\n\tpages = {7565--7570},\n\tyear = {2017},\n\tdoi = {10.1073/pnas.1700617114},\n\tpublisher = {National Academy of Sciences},\n\tabstract = {A qualitatively more diverse range of possible behaviors emerge in many-particle systems once external drives are allowed to push the system far from equilibrium; nonetheless, general thermodynamic principles governing nonequilibrium pattern formation and self-assembly have remained elusive, despite intense interest from researchers across disciplines. Here, we use the example of a randomly wired driven chemical reaction network to identify a key thermodynamic feature of a complex, driven system that characterizes the {\\textquotedblleft}specialness{\\textquotedblright} of its dynamical attractor behavior. We show that the network{\\textquoteright}s fixed points are biased toward the extremization of external forcing, causing them to become kinetically stabilized in rare corners of chemical space that are either atypically weakly or strongly coupled to external environmental drives.A chemical mixture that continually absorbs work from its environment may exhibit steady-state chemical concentrations that deviate from their equilibrium values. Such behavior is particularly interesting in a scenario where the environmental work sources are relatively difficult to access, so that only the proper orchestration of many distinct catalytic actors can power the dissipative flux required to maintain a stable, far-from-equilibrium steady state. In this article, we study the dynamics of an in silico chemical network with random connectivity in an environment that makes strong thermodynamic forcing available only to rare combinations of chemical concentrations. We find that the long-time dynamics of such systems are biased toward states that exhibit a fine-tuned extremization of environmental forcing.},\n\tissn = {0027-8424},\n\tURL = {https://www.pnas.org/content/114/29/7565},\n\teprint = {https://www.pnas.org/content/114/29/7565.full.pdf},\n\tjournal = {Proceedings of the National Academy of Sciences}\n}",
  "source": "pnas.org",
  "date": 1544290789,
  "tags": [],
  "doi": "10.1073/pnas.1700617114"
}