{
  "title": "Spectral redemption in clustering sparse networks",
  "authors": [
    "Florent Krzakala",
    "Cristopher Moore",
    "Elchanan Mossel",
    "Joe Neeman",
    "Allan Sly",
    "Lenka Zdeborová",
    "Pan Zhang"
  ],
  "abstract": "<p>Spectral algorithms are classic approaches to clustering and community detection in networks. However, for sparse networks the standard versions of these algorithms are suboptimal, in some cases completely failing to detect communities even when other algorithms such as belief propagation can do so. Here, we present a class of spectral algorithms based on a nonbacktracking walk on the directed edges of the graph. The spectrum of this operator is much better-behaved than that of the adjacency matrix or other commonly used matrices, maintaining a strong separation between the bulk eigenvalues and the eigenvalues relevant to community structure even in the sparse case. We show that our algorithm is optimal for graphs generated by the stochastic block model, detecting communities all of the way down to the theoretical limit. We also show the spectrum of the nonbacktracking operator for some real-world networks, illustrating its advantages over traditional spectral clustering.</p>",
  "id": "pnas.110/52/20935",
  "url": "https://www.pnas.org/content/110/52/20935",
  "pdf": "https://www.pnas.org/content/pnas/110/52/20935.full.pdf",
  "bibtex": "@article{krzakala20935,\n    title = {Spectral redemption in clustering sparse networks},\n    author = {Florent Krzakala and Cristopher Moore and Elchanan Mossel and Joe Neeman and Allan Sly and Lenka Zdeborov{\\'a} and Pan Zhang},\n    journal = {Proceedings of the National Academy of Sciences},\n    year = {2013},\n    doi = {10.1073/pnas.1312486110},\n    eprint = {https://www.pnas.org/content/110/52/20935.full.pdf},\n    issn = {0027-8424},\n    number = {52},\n    pages = {20935--20940},\n    publisher = {National Academy of Sciences},\n    volume = {110},\n    pdf = {{https://www.pnas.org/content/pnas/110/52/20935.full.pdf}},\n    url = {https://www.pnas.org/content/110/52/20935}\n}",
  "source": "pnas.org",
  "date": 1554747019,
  "tags": [],
  "doi": "10.1073/pnas.1312486110"
}