{
  "title": "Self-Attention Aligner: A Latency-Control End-to-End Model for ASR Using Self-Attention Network and Chunk-Hopping",
  "authors": [
    "Linhao Dong",
    "Feng Wang",
    "Bo Xu"
  ],
  "abstract": "Self-attention network, an attention-based feedforward neural network, has\nrecently shown the potential to replace recurrent neural networks (RNNs) in a\nvariety of NLP tasks. However, it is not clear if the self-attention network\ncould be a good alternative of RNNs in automatic speech recognition (ASR),\nwhich processes the longer speech sequences and may have online recognition\nrequirements. In this paper, we present a RNN-free end-to-end model:\nself-attention aligner (SAA), which applies the self-attention networks to a\nsimplified recurrent neural aligner (RNA) framework. We also propose a\nchunk-hopping mechanism, which enables the SAA model to encode on segmented\nframe chunks one after another to support online recognition. Experiments on\ntwo Mandarin ASR datasets show the replacement of RNNs by the self-attention\nnetworks yields a 8.4%-10.2% relative character error rate (CER) reduction. In\naddition, the chunk-hopping mechanism allows the SAA to have only a 2.5%\nrelative CER degradation with a 320ms latency. After jointly training with a\nself-attention network language model, our SAA model obtains further error rate\nreduction on multiple datasets. Especially, it achieves 24.12% CER on the\nMandarin ASR benchmark (HKUST), exceeding the best end-to-end model by over 2%\nabsolute CER.",
  "id": "arxiv.1902.06450",
  "url": "https://arxiv.org/abs/1902.06450",
  "pdf": "https://arxiv.org/pdf/1902.06450",
  "bibtex": "@misc{dong2019_arxiv:1902.06450,\n    title = {Self-Attention Aligner: A Latency-Control End-to-End Model for ASR Using Self-Attention Network and Chunk-Hopping},\n    author = {Linhao Dong and Feng Wang and Bo Xu},\n    year = {2019},\n    archiveprefix = {arXiv},\n    eprint = {1902.06450},\n    pdf = {https://arxiv.org/pdf/1902.06450},\n    url = {https://arxiv.org/abs/1902.06450}\n}",
  "source": "arxiv.org",
  "date": 1563789547,
  "tags": [],
  "api": "https://export.arxiv.org/api/query?id_list=1902.06450"
}