{
  "title": "Spatial Mixture Models with Learnable Deep Priors for Perceptual Grouping",
  "authors": [
    "Jinyang Yuan",
    "Bin Li",
    "Xiangyang Xue"
  ],
  "abstract": "Humans perceive the seemingly chaotic world in a structured and compositional\nway with the prerequisite of being able to segregate conceptual entities from\nthe complex visual scenes. The mechanism of grouping basic visual elements of\nscenes into conceptual entities is termed as perceptual grouping. In this work,\nwe propose a new type of spatial mixture models with learnable priors for\nperceptual grouping. Different from existing methods, the proposed method\ndisentangles the representation of an object into `shape' and `appearance'\nwhich are modeled separately by the mixture weights and the conditional\nprobability distributions. More specifically, each object in the visual scene\nis modeled by one mixture component, whose mixture weights and the parameter of\nthe conditional probability distribution are generated by two neural networks,\nrespectively. The mixture weights focus on modeling spatial dependencies (i.e.,\nshape) and the conditional probability distributions deal with intra-object\nvariations (i.e., appearance). In addition, the background is separately\nmodeled as a special component complementary to the foreground objects. Our\nextensive empirical tests on two perceptual grouping datasets demonstrate that\nthe proposed method outperforms the state-of-the-art methods under most\nexperimental configurations. The learned conceptual entities are generalizable\nto novel visual scenes and insensitive to the diversity of objects.",
  "id": "arxiv.1902.02502",
  "url": "https://arxiv.org/abs/1902.02502",
  "pdf": "https://arxiv.org/pdf/1902.02502",
  "bibtex": "@misc{yuan2019_arxiv:1902.02502,\n    title = {Spatial Mixture Models with Learnable Deep Priors for Perceptual Grouping},\n    author = {Jinyang Yuan, Bin Li, Xiangyang Xue},\n    year = {2019},\n    archiveprefix = {arXiv},\n    eprint = {1902.02502},\n    pdf = {https://arxiv.org/pdf/1902.02502},\n    url = https://arxiv.org/abs/1902.02502\n}",
  "source": "arxiv.org",
  "date": 1551484861,
  "tags": []
}