{
  "title": "Lingvo: a Modular and Scalable Framework for Sequence-to-Sequence Modeling",
  "authors": [
    "Jonathan Shen",
    "Patrick Nguyen",
    "Yonghui Wu",
    "Zhifeng Chen",
    "Mia X. Chen",
    "Ye Jia",
    "Anjuli Kannan",
    "Tara Sainath",
    "Yuan Cao",
    "Chung-Cheng Chiu",
    "Yanzhang He",
    "Jan Chorowski",
    "Smit Hinsu",
    "Stella Laurenzo",
    "James Qin",
    "Orhan Firat",
    "Wolfgang Macherey",
    "Suyog Gupta",
    "Ankur Bapna",
    "Shuyuan Zhang",
    "Ruoming Pang",
    "Ron J. Weiss",
    "Rohit Prabhavalkar",
    "Qiao Liang",
    "Benoit Jacob",
    "Bowen Liang",
    "HyoukJoong Lee",
    "Ciprian Chelba",
    "Sébastien Jean",
    "Bo Li",
    "Melvin Johnson",
    "Rohan Anil",
    "Rajat Tibrewal",
    "Xiaobing Liu",
    "Akiko Eriguchi",
    "Navdeep Jaitly",
    "Naveen Ari",
    "Colin Cherry",
    "Parisa Haghani",
    "Otavio Good",
    "Youlong Cheng",
    "Raziel Alvarez",
    "Isaac Caswell",
    "Wei-Ning Hsu",
    "Zongheng Yang",
    "Kuan-Chieh Wang",
    "Ekaterina Gonina",
    "Katrin Tomanek",
    "Ben Vanik",
    "Zelin Wu",
    "Llion Jones",
    "Mike Schuster",
    "Yanping Huang",
    "Dehao Chen",
    "Kazuki Irie",
    "George Foster",
    "John Richardson",
    "Klaus Macherey",
    "Antoine Bruguier",
    "Heiga Zen",
    "Colin Raffel",
    "Shankar Kumar",
    "Kanishka Rao",
    "David Rybach",
    "Matthew Murray",
    "Vijayaditya Peddinti",
    "Maxim Krikun",
    "Michiel A. U. Bacchiani",
    "Thomas B. Jablin",
    "Rob Suderman",
    "Ian Williams",
    "Benjamin Lee",
    "Deepti Bhatia",
    "Justin Carlson",
    "Semih Yavuz",
    "Yu Zhang",
    "Ian McGraw",
    "Max Galkin",
    "Qi Ge",
    "Golan Pundak",
    "Chad Whipkey",
    "Todd Wang",
    "Uri Alon",
    "Dmitry Lepikhin",
    "Ye Tian",
    "Sara Sabour",
    "William Chan",
    "Shubham Toshniwal",
    "Baohua Liao",
    "Michael Nirschl",
    "Pat Rondon"
  ],
  "abstract": "  Lingvo is a Tensorflow framework offering a complete solution for\ncollaborative deep learning research, with a particular focus towards\nsequence-to-sequence models. Lingvo models are composed of modular building\nblocks that are flexible and easily extensible, and experiment configurations\nare centralized and highly customizable. Distributed training and quantized\ninference are supported directly within the framework, and it contains existing\nimplementations of a large number of utilities, helper functions, and the\nnewest research ideas. Lingvo has been used in collaboration by dozens of\nresearchers in more than 20 papers over the last two years. This document\noutlines the underlying design of Lingvo and serves as an introduction to the\nvarious pieces of the framework, while also offering examples of advanced\nfeatures that showcase the capabilities of the framework.\n",
  "id": "arxiv.1902.08295",
  "url": "https://arxiv.org/abs/1902.08295",
  "pdf": "https://arxiv.org/pdf/1902.08295",
  "bibtex": "@misc{shen2019_arxiv:1902.08295,\n    title = {Lingvo: a Modular and Scalable Framework for Sequence-to-Sequence Modeling},\n    author = {Jonathan Shen, Patrick Nguyen, Yonghui Wu, Zhifeng Chen, Mia X. Chen, Ye Jia, Anjuli Kannan, Tara Sainath, Yuan Cao, Chung-Cheng Chiu, Yanzhang He, Jan Chorowski, Smit Hinsu, Stella Laurenzo, James Qin, Orhan Firat, Wolfgang Macherey, Suyog Gupta, Ankur Bapna, Shuyuan Zhang, Ruoming Pang, Ron J. Weiss, Rohit Prabhavalkar, Qiao Liang, Benoit Jacob, Bowen Liang, HyoukJoong Lee, Ciprian Chelba, Sébastien Jean, Bo Li, Melvin Johnson, Rohan Anil, Rajat Tibrewal, Xiaobing Liu, Akiko Eriguchi, Navdeep Jaitly, Naveen Ari, Colin Cherry, Parisa Haghani, Otavio Good, Youlong Cheng, Raziel Alvarez, Isaac Caswell, Wei-Ning Hsu, Zongheng Yang, Kuan-Chieh Wang, Ekaterina Gonina, Katrin Tomanek, Ben Vanik, Zelin Wu, Llion Jones, Mike Schuster, Yanping Huang, Dehao Chen, Kazuki Irie, George Foster, John Richardson, Klaus Macherey, Antoine Bruguier, Heiga Zen, Colin Raffel, Shankar Kumar, Kanishka Rao, David Rybach, Matthew Murray, Vijayaditya Peddinti, Maxim Krikun, Michiel A. U. Bacchiani, Thomas B. Jablin, Rob Suderman, Ian Williams, Benjamin Lee, Deepti Bhatia, Justin Carlson, Semih Yavuz, Yu Zhang, Ian McGraw, Max Galkin, Qi Ge, Golan Pundak, Chad Whipkey, Todd Wang, Uri Alon, Dmitry Lepikhin, Ye Tian, Sara Sabour, William Chan, Shubham Toshniwal, Baohua Liao, Michael Nirschl, Pat Rondon},\n    year = {2019},\n    archiveprefix = {arXiv},\n    eprint = {1902.08295},\n    pdf = {https://arxiv.org/pdf/1902.08295},\n    url = undefined\n}",
  "source": "arxiv.org",
  "date": 1551110083,
  "tags": []
}