{
  "title": "Leveraging Large-Scale Uncurated Data for Unsupervised Pre-training of Visual Features",
  "authors": [
    "Mathilde Caron",
    "Piotr Bojanowski",
    "Julien Mairal",
    "Armand Joulin"
  ],
  "abstract": "Pre-training general-purpose visual features with convolutional neural\nnetworks without relying on annotations is a challenging and important task.\nMost recent efforts in unsupervised feature learning have focused on either\nsmall or highly curated datasets like ImageNet, whereas using uncurated raw\ndatasets was found to decrease the feature quality when evaluated on a transfer\ntask. Our goal is to bridge the performance gap between unsupervised methods\ntrained on curated data, which are costly to obtain, and massive raw datasets\nthat are easily available. To that effect, we propose a new unsupervised\napproach which leverages self-supervision and clustering to capture\ncomplementary statistics from large-scale data. We validate our approach on 96\nmillion images from YFCC100M, achieving state-of-the-art results among\nunsupervised methods on standard benchmarks, which confirms the potential of\nunsupervised learning when only uncurated data are available. We also show that\npre-training a supervised VGG-16 with our method achieves 74.6% top-1 accuracy\non the validation set of ImageNet classification, which is an improvement of\n+0.7% over the same network trained from scratch.",
  "id": "arxiv.1905.01278",
  "url": "https://arxiv.org/abs/1905.01278",
  "pdf": "https://arxiv.org/pdf/1905.01278",
  "bibtex": "@misc{caron2019_arxiv:1905.01278,\n    title = {Leveraging Large-Scale Uncurated Data for Unsupervised Pre-training of Visual Features},\n    author = {Mathilde Caron and Piotr Bojanowski and Julien Mairal and Armand Joulin},\n    year = {2019},\n    archiveprefix = {arXiv},\n    eprint = {1905.01278},\n    pdf = {https://arxiv.org/pdf/1905.01278},\n    url = {https://arxiv.org/abs/1905.01278}\n}",
  "source": "arxiv.org",
  "date": 1557240428,
  "tags": [],
  "api": "https://export.arxiv.org/api/query?id_list=1905.01278?fbclid=IwAR1RSkAO9KgDr4KBQOLdM0vwna217jYIDyZmClBdc-37WSIM2FNXlKheVdI"
}