{
  "title": "Meta-learning of Sequential Strategies",
  "authors": [
    "Pedro A. Ortega",
    "Jane X. Wang",
    "Mark Rowland",
    "Tim Genewein",
    "Zeb Kurth-Nelson",
    "Razvan Pascanu",
    "Nicolas Heess",
    "Joel Veness",
    "Alex Pritzel",
    "Pablo Sprechmann",
    "Siddhant M. Jayakumar",
    "Tom McGrath",
    "Kevin Miller",
    "Mohammad Azar",
    "Ian Osband",
    "Neil Rabinowitz",
    "András György",
    "Silvia Chiappa",
    "Simon Osindero",
    "Yee Whye Teh",
    "Hado van Hasselt",
    "Nando de Freitas",
    "Matthew Botvinick",
    "Shane Legg"
  ],
  "abstract": "In this report we review memory-based meta-learning as a tool for building\nsample-efficient strategies that learn from past experience to adapt to any\ntask within a target class. Our goal is to equip the reader with the conceptual\nfoundations of this tool for building new, scalable agents that operate on\nbroad domains. To do so, we present basic algorithmic templates for building\nnear-optimal predictors and reinforcement learners which behave as if they had\na probabilistic model that allowed them to efficiently exploit task structure.\nFurthermore, we recast memory-based meta-learning within a Bayesian framework,\nshowing that the meta-learned strategies are near-optimal because they amortize\nBayes-filtered data, where the adaptation is implemented in the memory dynamics\nas a state-machine of sufficient statistics. Essentially, memory-based\nmeta-learning translates the hard problem of probabilistic sequential inference\ninto a regression problem.",
  "id": "arxiv.1905.03030",
  "url": "https://arxiv.org/abs/1905.03030",
  "pdf": "https://arxiv.org/pdf/1905.03030",
  "bibtex": "@misc{ortega2019_arxiv:1905.03030,\n    title = {Meta-learning of Sequential Strategies},\n    author = {Pedro A. Ortega and Jane X. Wang and Mark Rowland and Tim Genewein and Zeb Kurth-Nelson and Razvan Pascanu and Nicolas Heess and Joel Veness and Alex Pritzel and Pablo Sprechmann and Siddhant M. Jayakumar and Tom McGrath and Kevin Miller and Mohammad Azar and Ian Osband and Neil Rabinowitz and András György and Silvia Chiappa and Simon Osindero and Yee Whye Teh and Hado van Hasselt and Nando de Freitas and Matthew Botvinick and Shane Legg},\n    year = {2019},\n    archiveprefix = {arXiv},\n    eprint = {1905.03030},\n    pdf = {https://arxiv.org/pdf/1905.03030},\n    url = {https://arxiv.org/abs/1905.03030}\n}",
  "source": "arxiv.org",
  "date": 1557401246,
  "tags": [],
  "api": "https://export.arxiv.org/api/query?id_list=1905.03030"
}