{
  "title": "Fisher Information and Natural Gradient Learning of Random Deep Networks",
  "authors": [
    "Shun-ichi Amari",
    "Ryo Karakida",
    "Masafumi Oizumi"
  ],
  "abstract": "  A deep neural network is a hierarchical nonlinear model transforming input\nsignals to output signals. Its input-output relation is considered to be\nstochastic, being described for a given input by a parameterized conditional\nprobability distribution of outputs. The space of parameters consisting of\nweights and biases is a Riemannian manifold, where the metric is defined by the\nFisher information matrix. The natural gradient method uses the steepest\ndescent direction in a Riemannian manifold, so it is effective in learning,\navoiding plateaus. It requires inversion of the Fisher information matrix,\nhowever, which is practically impossible when the matrix has a huge number of\ndimensions. Many methods for approximating the natural gradient have therefore\nbeen introduced. The present paper uses statistical neurodynamical method to\nreveal the properties of the Fisher information matrix in a net of random\nconnections under the mean field approximation. We prove that the Fisher\ninformation matrix is unit-wise block diagonal supplemented by small order\nterms of off-block-diagonal elements, which provides a justification for the\nquasi-diagonal natural gradient method by Y. Ollivier. A unitwise\nblock-diagonal Fisher metrix reduces to the tensor product of the Fisher\ninformation matrices of single units. We further prove that the Fisher\ninformation matrix of a single unit has a simple reduced form, a sum of a\ndiagonal matrix and a rank 2 matrix of weight-bias correlations. We obtain the\ninverse of Fisher information explicitly. We then have an explicit form of the\nnatural gradient, without relying on the numerical matrix inversion, which\ndrastically speeds up stochastic gradient learning.\n",
  "id": "arxiv.1808.07172",
  "url": "https://arxiv.org/abs/1808.07172",
  "pdf": "https://arxiv.org/pdf/1808.07172",
  "source": "arxiv.org",
  "date": 1545226556,
  "tags": []
}