{
  "title": "Streaming End-to-end Speech Recognition For Mobile Devices",
  "authors": [
    "Yanzhang He",
    "Tara N. Sainath",
    "Rohit Prabhavalkar",
    "Ian McGraw",
    "Raziel Alvarez",
    "Ding Zhao",
    "David Rybach",
    "Anjuli Kannan",
    "Yonghui Wu",
    "Ruoming Pang",
    "Qiao Liang",
    "Deepti Bhatia",
    "Yuan Shangguan",
    "Bo Li",
    "Golan Pundak",
    "Khe Chai Sim",
    "Tom Bagby",
    "Shuo-yiin Chang",
    "Kanishka Rao",
    "Alexander Gruenstein"
  ],
  "abstract": "End-to-end (E2E) models, which directly predict output character sequences\ngiven input speech, are good candidates for on-device speech recognition. E2E\nmodels, however, present numerous challenges: In order to be truly useful, such\nmodels must decode speech utterances in a streaming fashion, in real time; they\nmust be robust to the long tail of use cases; they must be able to leverage\nuser-specific context (e.g., contact lists); and above all, they must be\nextremely accurate. In this work, we describe our efforts at building an E2E\nspeech recognizer using a recurrent neural network transducer. In experimental\nevaluations, we find that the proposed approach can outperform a conventional\nCTC-based model in terms of both latency and accuracy in a number of evaluation\ncategories.",
  "id": "arxiv.1811.06621",
  "url": "https://arxiv.org/abs/1811.06621",
  "pdf": "https://arxiv.org/pdf/1811.06621",
  "bibtex": "@misc{he2018_arxiv:1811.06621,\n    title = {Streaming End-to-end Speech Recognition For Mobile Devices},\n    author = {Yanzhang He and Tara N. Sainath and Rohit Prabhavalkar and Ian McGraw and Raziel Alvarez and Ding Zhao and David Rybach and Anjuli Kannan and Yonghui Wu and Ruoming Pang and Qiao Liang and Deepti Bhatia and Yuan Shangguan and Bo Li and Golan Pundak and Khe Chai Sim and Tom Bagby and Shuo-yiin Chang and Kanishka Rao and Alexander Gruenstein},\n    year = {2018},\n    archiveprefix = {arXiv},\n    eprint = {1811.06621},\n    pdf = {https://arxiv.org/pdf/1811.06621},\n    url = {https://arxiv.org/abs/1811.06621}\n}",
  "source": "arxiv.org",
  "date": 1561380775,
  "tags": [],
  "api": "https://export.arxiv.org/api/query?id_list=1811.06621"
}