{
  "title": "The Lottery Ticket Hypothesis at Scale",
  "authors": [
    "Jonathan Frankle",
    "Gintare Karolina Dziugaite",
    "Daniel M. Roy",
    "Michael Carbin"
  ],
  "abstract": "Recent work on the \"lottery ticket hypothesis\" proposes that\nrandomly-initialized, dense neural networks contain much smaller, fortuitously\ninitialized subnetworks (\"winning tickets\") capable of training to similar\naccuracy as the original network at a similar speed. While strong evidence\nexists for the hypothesis across many settings, it has not yet been evaluated\non large, state-of-the-art networks and there is even evidence against the\nhypothesis on deeper networks.\n  We modify the lottery ticket pruning procedure to make it possible to\nidentify winning tickets on deeper networks. Rather than set the weights of a\nwinning ticket to their original initializations, we set them to the weights\nobtained after a small number of training iterations (\"late resetting\"). Using\nlate resetting, we identify the first winning tickets for Resnet-50 on Imagenet\n  To understand the efficacy of late resetting, we study the \"stability\" of\nneural network training to pruning, which we define as the consistency of the\noptimization trajectories followed by a winning ticket when it is trained in\nisolation and as part of the larger network. We find that later resetting\nproduces stabler winning tickets and that improved stability correlates with\nhigher winning ticket accuracy. This analysis offers new insights into the\nlottery ticket hypothesis and the dynamics of neural network learning.",
  "id": "arxiv.1903.01611",
  "url": "https://arxiv.org/abs/1903.01611",
  "pdf": "https://arxiv.org/pdf/1903.01611",
  "bibtex": "@misc{frankle2019_arxiv:1903.01611,\n    title = {The Lottery Ticket Hypothesis at Scale},\n    author = {Jonathan Frankle, Gintare Karolina Dziugaite, Daniel M. Roy, Michael Carbin},\n    year = {2019},\n    archiveprefix = {arXiv},\n    eprint = {1903.01611},\n    pdf = {https://arxiv.org/pdf/1903.01611},\n    url = https://arxiv.org/abs/1903.01611\n}",
  "source": "arxiv.org",
  "date": 1551890722,
  "tags": []
}