{
  "title": "AVID: Adversarial Visual Irregularity Detection",
  "authors": [
    "Mohammad Sabokrou",
    "Masoud Pourreza",
    "Mohsen Fayyaz",
    "Rahim Entezari",
    "Mahmood Fathy",
    "Jürgen Gall",
    "Ehsan Adeli"
  ],
  "abstract": "Real-time detection of irregularities in visual data is very invaluable and\nuseful in many prospective applications including surveillance, patient\nmonitoring systems, etc. With the surge of deep learning methods in the recent\nyears, researchers have tried a wide spectrum of methods for different\napplications. However, for the case of irregularity or anomaly detection in\nvideos, training an end-to-end model is still an open challenge, since often\nirregularity is not well-defined and there are not enough irregular samples to\nuse during training. In this paper, inspired by the success of generative\nadversarial networks (GANs) for training deep models in unsupervised or\nself-supervised settings, we propose an end-to-end deep network for detection\nand fine localization of irregularities in videos (and images). Our proposed\narchitecture is composed of two networks, which are trained in competing with\neach other while collaborating to find the irregularity. One network works as a\npixel-level irregularity Inpainter, and the other works as a patch-level\nDetector. After an adversarial self-supervised training, in which I tries to\nfool D into accepting its inpainted output as regular (normal), the two\nnetworks collaborate to detect and fine-segment the irregularity in any given\ntesting video. Our results on three different datasets show that our method can\noutperform the state-of-the-art and fine-segment the irregularity.",
  "id": "arxiv.1805.09521",
  "url": "https://arxiv.org/abs/1805.09521",
  "pdf": "https://arxiv.org/pdf/1805.09521",
  "bibtex": "@misc{sabokrou2018_arxiv:1805.09521,\n    title = {AVID: Adversarial Visual Irregularity Detection},\n    author = {Mohammad Sabokrou and Masoud Pourreza and Mohsen Fayyaz and Rahim Entezari and Mahmood Fathy and Jürgen Gall and Ehsan Adeli},\n    year = {2018},\n    archiveprefix = {arXiv},\n    eprint = {1805.09521},\n    pdf = {https://arxiv.org/pdf/1805.09521},\n    url = {https://arxiv.org/abs/1805.09521}\n}",
  "source": "arxiv.org",
  "date": 1556889277,
  "tags": [],
  "api": "https://export.arxiv.org/api/query?id_list=1805.09521"
}