{
  "title": "Structured Attention Networks",
  "authors": [
    "Yoon Kim",
    "Carl Denton",
    "Luong Hoang",
    "Alexander M. Rush"
  ],
  "abstract": "Attention networks have proven to be an effective approach for embedding\ncategorical inference within a deep neural network. However, for many tasks we\nmay want to model richer structural dependencies without abandoning end-to-end\ntraining. In this work, we experiment with incorporating richer structural\ndistributions, encoded using graphical models, within deep networks. We show\nthat these structured attention networks are simple extensions of the basic\nattention procedure, and that they allow for extending attention beyond the\nstandard soft-selection approach, such as attending to partial segmentations or\nto subtrees. We experiment with two different classes of structured attention\nnetworks: a linear-chain conditional random field and a graph-based parsing\nmodel, and describe how these models can be practically implemented as neural\nnetwork layers. Experiments show that this approach is effective for\nincorporating structural biases, and structured attention networks outperform\nbaseline attention models on a variety of synthetic and real tasks: tree\ntransduction, neural machine translation, question answering, and natural\nlanguage inference. We further find that models trained in this way learn\ninteresting unsupervised hidden representations that generalize simple\nattention.",
  "id": "arxiv.1702.00887",
  "url": "https://arxiv.org/abs/1702.00887",
  "pdf": "https://arxiv.org/pdf/1702.00887",
  "bibtex": "@misc{kim2017_arxiv:1702.00887,\n    title = {Structured Attention Networks},\n    author = {Yoon Kim and Carl Denton and Luong Hoang and Alexander M. Rush},\n    year = {2017},\n    archiveprefix = {arXiv},\n    eprint = {1702.00887},\n    pdf = {{https://arxiv.org/pdf/1702.00887}},\n    url = {https://arxiv.org/abs/1702.00887}\n}",
  "source": "arxiv.org",
  "date": 1554123924,
  "tags": [],
  "api": "https://export.arxiv.org/api/query?id_list=1702.00887"
}