{
  "title": "PaintBot: A Reinforcement Learning Approach for Natural Media Painting",
  "authors": [
    "Biao Jia",
    "Chen Fang",
    "Jonathan Brandt",
    "Byungmoon Kim",
    "Dinesh Manocha"
  ],
  "abstract": "We propose a new automated digital painting framework, based on a painting\nagent trained through reinforcement learning. To synthesize an image, the agent\nselects a sequence of continuous-valued actions representing primitive painting\nstrokes, which are accumulated on a digital canvas. Action selection is guided\nby a given reference image, which the agent attempts to replicate subject to\nthe limitations of the action space and the agent's learned policy. The\npainting agent policy is determined using a variant of proximal policy\noptimization reinforcement learning. During training, our agent is presented\nwith patches sampled from an ensemble of reference images. To accelerate\ntraining convergence, we adopt a curriculum learning strategy, whereby\nreference patches are sampled according to how challenging they are using the\ncurrent policy. We experiment with differing loss functions, including\npixel-wise and perceptual loss, which have consequent differing effects on the\nlearned policy. We demonstrate that our painting agent can learn an effective\npolicy with a high dimensional continuous action space comprising pen pressure,\nwidth, tilt, and color, for a variety of painting styles. Through a\ncoarse-to-fine refinement process our agent can paint arbitrarily complex\nimages in the desired style.",
  "id": "arxiv.1904.02201",
  "url": "https://arxiv.org/abs/1904.02201",
  "pdf": "https://arxiv.org/pdf/1904.02201",
  "bibtex": "@misc{jia2019_arxiv:1904.02201,\n    title = {PaintBot: A Reinforcement Learning Approach for Natural Media Painting},\n    author = {Biao Jia and Chen Fang and Jonathan Brandt and Byungmoon Kim and Dinesh Manocha},\n    year = {2019},\n    archiveprefix = {arXiv},\n    eprint = {1904.02201},\n    pdf = {{https://arxiv.org/pdf/1904.02201}},\n    url = {https://arxiv.org/abs/1904.02201}\n}",
  "source": "arxiv.org",
  "date": 1554671745,
  "tags": [],
  "api": "https://export.arxiv.org/api/query?id_list=1904.02201"
}