{
  "title": "Learning Awareness Models",
  "authors": [
    "Brandon Amos",
    "Laurent Dinh",
    "Serkan Cabi",
    "Thomas Rothörl",
    "Sergio Gómez Colmenarejo",
    "Alistair Muldal",
    "Tom Erez",
    "Yuval Tassa",
    "Nando de Freitas",
    "Misha Denil"
  ],
  "abstract": "We consider the setting of an agent with a fixed body interacting with an\nunknown and uncertain external world. We show that models trained to predict\nproprioceptive information about the agent's body come to represent objects in\nthe external world. In spite of being trained with only internally available\nsignals, these dynamic body models come to represent external objects through\nthe necessity of predicting their effects on the agent's own body. That is, the\nmodel learns holistic persistent representations of objects in the world, even\nthough the only training signals are body signals. Our dynamics model is able\nto successfully predict distributions over 132 sensor readings over 100 steps\ninto the future and we demonstrate that even when the body is no longer in\ncontact with an object, the latent variables of the dynamics model continue to\nrepresent its shape. We show that active data collection by maximizing the\nentropy of predictions about the body---touch sensors, proprioception and\nvestibular information---leads to learning of dynamic models that show superior\nperformance when used for control. We also collect data from a real robotic\nhand and show that the same models can be used to answer questions about\nproperties of objects in the real world. Videos with qualitative results of our\nmodels are available at https://goo.gl/mZuqAV.",
  "id": "arxiv.1804.06318",
  "url": "https://arxiv.org/abs/1804.06318",
  "pdf": "https://arxiv.org/pdf/1804.06318",
  "bibtex": "@misc{amos2018_arxiv:1804.06318,\n    title = {Learning Awareness Models},\n    author = {Brandon Amos and Laurent Dinh and Serkan Cabi and Thomas Rothörl and Sergio Gómez Colmenarejo and Alistair Muldal and Tom Erez and Yuval Tassa and Nando de Freitas and Misha Denil},\n    year = {2018},\n    archiveprefix = {arXiv},\n    eprint = {1804.06318},\n    pdf = {https://arxiv.org/pdf/1804.06318},\n    url = {https://arxiv.org/abs/1804.06318}\n}",
  "source": "arxiv.org",
  "date": 1563043280,
  "tags": [],
  "api": "https://export.arxiv.org/api/query?id_list=1804.06318"
}