{
  "title": "Deep Speech 2: End-to-End Speech Recognition in English and Mandarin",
  "authors": [
    "Dario Amodei",
    "Rishita Anubhai",
    "Eric Battenberg",
    "Carl Case",
    "Jared Casper",
    "Bryan Catanzaro",
    "Jingdong Chen",
    "Mike Chrzanowski",
    "Adam Coates",
    "Greg Diamos",
    "Erich Elsen",
    "Jesse Engel",
    "Linxi Fan",
    "Christopher Fougner",
    "Tony Han",
    "Awni Hannun",
    "Billy Jun",
    "Patrick LeGresley",
    "Libby Lin",
    "Sharan Narang",
    "Andrew Ng",
    "Sherjil Ozair",
    "Ryan Prenger",
    "Jonathan Raiman",
    "Sanjeev Satheesh",
    "David Seetapun",
    "Shubho Sengupta",
    "Yi Wang",
    "Zhiqian Wang",
    "Chong Wang",
    "Bo Xiao",
    "Dani Yogatama",
    "Jun Zhan",
    "Zhenyao Zhu"
  ],
  "abstract": "We show that an end-to-end deep learning approach can be used to recognize\neither English or Mandarin Chinese speech--two vastly different languages.\nBecause it replaces entire pipelines of hand-engineered components with neural\nnetworks, end-to-end learning allows us to handle a diverse variety of speech\nincluding noisy environments, accents and different languages. Key to our\napproach is our application of HPC techniques, resulting in a 7x speedup over\nour previous system. Because of this efficiency, experiments that previously\ntook weeks now run in days. This enables us to iterate more quickly to identify\nsuperior architectures and algorithms. As a result, in several cases, our\nsystem is competitive with the transcription of human workers when benchmarked\non standard datasets. Finally, using a technique called Batch Dispatch with\nGPUs in the data center, we show that our system can be inexpensively deployed\nin an online setting, delivering low latency when serving users at scale.",
  "id": "arxiv.1512.02595",
  "url": "https://arxiv.org/abs/1512.02595",
  "pdf": "https://arxiv.org/pdf/1512.02595",
  "bibtex": "@misc{amodei2015_arxiv:1512.02595,\n    title = {Deep Speech 2: End-to-End Speech Recognition in English and Mandarin},\n    author = {Dario Amodei and Rishita Anubhai and Eric Battenberg and Carl Case and Jared Casper and Bryan Catanzaro and Jingdong Chen and Mike Chrzanowski and Adam Coates and Greg Diamos and Erich Elsen and Jesse Engel and Linxi Fan and Christopher Fougner and Tony Han and Awni Hannun and Billy Jun and Patrick LeGresley and Libby Lin and Sharan Narang and Andrew Ng and Sherjil Ozair and Ryan Prenger and Jonathan Raiman and Sanjeev Satheesh and David Seetapun and Shubho Sengupta and Yi Wang and Zhiqian Wang and Chong Wang and Bo Xiao and Dani Yogatama and Jun Zhan and Zhenyao Zhu},\n    year = {2015},\n    archiveprefix = {arXiv},\n    eprint = {1512.02595},\n    pdf = {https://arxiv.org/pdf/1512.02595},\n    url = {https://arxiv.org/abs/1512.02595}\n}",
  "source": "arxiv.org",
  "date": 1558342482,
  "tags": [],
  "api": "https://export.arxiv.org/api/query?id_list=1512.02595"
}