{
  "title": "Sample-Efficient Neural Architecture Search by Learning Action Space",
  "authors": [
    "Linnan Wang",
    "Saining Xie",
    "Teng Li",
    "Rodrigo Fonseca",
    "Yuandong Tian"
  ],
  "abstract": "Neural Architecture Search (NAS) has emerged as a promising technique for\nautomatic neural network design. However, existing NAS approaches often utilize\nmanually designed action space, which is not directly related to the\nperformance metric to be optimized (e.g., accuracy). As a result, using\nmanually designed action space to perform NAS often leads to sample-inefficient\nexplorations of architectures and thus can be sub-optimal. In order to improve\nsample efficiency, this paper proposes Latent Action Neural Architecture Search\n(LaNAS) that learns the action space to recursively partition the architecture\nsearch space into regions, each with concentrated performance metrics\n(\\emph{i.e.}, low variance). During the search phase, as different architecture\nsearch action sequences lead to regions of different performance, the search\nefficiency can be significantly improved by biasing towards the regions with\ngood performance. On the largest NAS dataset NasBench-101, our experimental\nresults demonstrated that LaNAS is 22x, 14.6x and 12.4x more sample-efficient\nthan random search, regularized evolution, and Monte Carlo Tree Search (MCTS)\nrespectively. When applied to the open domain, LaNAS finds an architecture that\nachieves SoTA 98.0% accuracy on CIFAR-10 and 75.0% top1 accuracy on ImageNet\n(mobile setting), after exploring only 6,000 architectures.",
  "id": "arxiv.1906.06832",
  "url": "https://arxiv.org/abs/1906.06832",
  "pdf": "https://arxiv.org/pdf/1906.06832",
  "bibtex": "@misc{wang2019_arxiv:1906.06832,\n    title = {Sample-Efficient Neural Architecture Search by Learning Action Space},\n    author = {Linnan Wang and Saining Xie and Teng Li and Rodrigo Fonseca and Yuandong Tian},\n    year = {2019},\n    archiveprefix = {arXiv},\n    eprint = {1906.06832},\n    pdf = {https://arxiv.org/pdf/1906.06832},\n    url = {https://arxiv.org/abs/1906.06832}\n}",
  "source": "arxiv.org",
  "date": 1560875092,
  "tags": [],
  "api": "https://export.arxiv.org/api/query?id_list=1906.06832"
}