{
  "title": "Surprising Effectiveness of Few-Image Unsupervised Feature Learning",
  "authors": [
    "Yuki M. Asano",
    "Christian Rupprecht",
    "Andrea Vedaldi"
  ],
  "abstract": "State-of-the-art methods for unsupervised representation learning can train\nwell the first few layers of standard convolutional neural networks, but they\nare not as good as supervised learning for deeper layers. This is likely due to\nthe generic and relatively simple nature of shallow layers; and yet, these\napproaches are applied to millions of images, scalability being advertised as\ntheir major advantage since unlabelled data is cheap to collect. In this paper\nwe question this practice and ask whether so many images are actually needed to\nlearn the layers for which unsupervised learning works best. Our main result is\nthat a few or even a single image together with strong data augmentation are\nsufficient to nearly saturate performance. Specifically, we provide an analysis\nfor three different self-supervised feature learning methods (BiGAN, RotNet,\nDeepCluster) vs number of training images (1, 10, 1000) and show that we can\ntop the accuracy for the first two convolutional layers of common networks\nusing just a single unlabelled training image and obtain competitive results\nfor other layers. We further study and visualize the learned representation as\na function of which (single) image is used for training. Our results are also\nsuggestive of which type of information may be captured by shallow layers in\ndeep networks.",
  "id": "arxiv.1904.13132",
  "url": "https://arxiv.org/abs/1904.13132",
  "pdf": "https://arxiv.org/pdf/1904.13132",
  "bibtex": "@misc{asano2019_arxiv:1904.13132,\n    title = {Surprising Effectiveness of Few-Image Unsupervised Feature Learning},\n    author = {Yuki M. Asano and Christian Rupprecht and Andrea Vedaldi},\n    year = {2019},\n    archiveprefix = {arXiv},\n    eprint = {1904.13132},\n    pdf = {https://arxiv.org/pdf/1904.13132},\n    url = {https://arxiv.org/abs/1904.13132}\n}",
  "source": "arxiv.org",
  "date": 1556714753,
  "tags": [],
  "api": "https://export.arxiv.org/api/query?id_list=1904.13132"
}