{
  "title": "BIVA: A Very Deep Hierarchy of Latent Variables for Generative Modeling",
  "authors": [
    "Lars Maaløe",
    "Marco Fraccaro",
    "Valentin Liévin",
    "Ole Winther"
  ],
  "abstract": "  With the introduction of the variational autoencoder (VAE), probabilistic\nlatent variable models have received renewed attention as powerful generative\nmodels. However, their performance in terms of test likelihood and quality of\ngenerated samples has been surpassed by autoregressive models without\nstochastic units. Furthermore, flow-based models have recently been shown to be\nan attractive alternative that scales well to high-dimensional data. In this\npaper we close the performance gap by constructing VAE models that can\neffectively utilize a deep hierarchy of stochastic variables and model complex\ncovariance structures. We introduce the Bidirectional-Inference Variational\nAutoencoder (BIVA), characterized by a skip-connected generative model and an\ninference network formed by a bidirectional stochastic inference path. We show\nthat BIVA reaches state-of-the-art test likelihoods, generates sharp and\ncoherent natural images, and uses the hierarchy of latent variables to capture\ndifferent aspects of the data distribution. We observe that BIVA, in contrast\nto recent results, can be used for anomaly detection. We attribute this to the\nhierarchy of latent variables which is able to extract high-level semantic\nfeatures. Finally, we extend BIVA to semi-supervised classification tasks and\nshow that it performs comparably to state-of-the-art results by generative\nadversarial networks.\n",
  "id": "arxiv.1902.02102",
  "url": "https://arxiv.org/abs/1902.02102",
  "pdf": "https://arxiv.org/pdf/1902.02102",
  "bibtex": "@misc{maaløe2019_arxiv:1902.02102,\n    title = {BIVA: A Very Deep Hierarchy of Latent Variables for Generative Modeling},\n    author = {Lars Maaløe, Marco Fraccaro, Valentin Liévin, Ole Winther},\n    year = {2019},\n    archiveprefix = {arXiv},\n    eprint = {1902.02102},\n    pdf = {https://arxiv.org/pdf/1902.02102},\n    url = {https://arxiv.org/abs/1902.02102}\n}",
  "source": "arxiv.org",
  "date": 1549670463,
  "tags": []
}