{
  "title": "Visual SLAM: Why Bundle Adjust?",
  "authors": [
    "Alvaro Parra Bustos",
    "Tat-Jun Chin",
    "Anders Eriksson",
    "Ian Reid"
  ],
  "abstract": "  Bundle adjustment plays a vital role in feature-based monocular SLAM. In many\nmodern SLAM pipelines, bundle adjustment is performed to estimate the 6DOF\ncamera trajectory and 3D map (3D point cloud) from the input feature tracks.\nHowever, two fundamental weaknesses plague SLAM systems based on bundle\nadjustment. First, the need to carefully initialise bundle adjustment means\nthat all variables, in particular the map, must be estimated as accurately as\npossible and maintained over time, which makes the overall algorithm\ncumbersome. Second, since estimating the 3D structure (which requires\nsufficient baseline) is inherent in bundle adjustment, the SLAM algorithm will\nencounter difficulties during periods of slow motion or pure rotational motion.\n  We propose a different SLAM optimisation core: instead of bundle adjustment,\nwe conduct rotation averaging to incrementally optimise only camera\norientations. Given the orientations, we estimate the camera positions and 3D\npoints via a quasi-convex formulation that can be solved efficiently and\nglobally optimally. Our approach not only obviates the need to estimate and\nmaintain the positions and 3D map at keyframe rate (which enables simpler SLAM\nsystems), it is also more capable of handling slow motions or pure rotational\nmotions.\n",
  "id": "arxiv.1902.03747",
  "url": "https://arxiv.org/abs/1902.03747",
  "pdf": "https://arxiv.org/pdf/1902.03747",
  "bibtex": "@misc{bustos2019_arxiv:1902.03747,\n    title = {Visual SLAM: Why Bundle Adjust?},\n    author = {Alvaro Parra Bustos, Tat-Jun Chin, Anders Eriksson, Ian Reid},\n    year = {2019},\n    archiveprefix = {arXiv},\n    eprint = {1902.03747},\n    pdf = {https://arxiv.org/pdf/1902.03747},\n    url = {https://arxiv.org/abs/1902.03747}\n}",
  "source": "arxiv.org",
  "date": 1549998750,
  "tags": []
}