{
  "title": "Cerebrospinal fluid transcriptional analyses reveals upregulation of IL-17, Type 1 interferon transcriptional pathways and neutrophil persistence genes associated with increased mortality from pneumococcal meningitis in adults",
  "authors": [
    "Emma CB Wall",
    "Jose Afonso Guerra-Assuncao",
    "Gabriele Pollara",
    "Cristina Venturini",
    "Veronica Mlowzowa",
    "Theresa Allain",
    "David Lalloo",
    "Mahdad Noursadeghi",
    "Jeremy S Brown",
    "Robert Heyderman"
  ],
  "abstract": "<p>Background: Improving outcomes from pneumococcal meningitis (PM), particularly in populations with high HIV prevalence, requires better understanding of host inflammatory responses to infection. \nMethods: We compared the transcriptome in pre-antibiotic cerebrospinal fluid (CSF) and blood from Malawian adults with PM using RNA sequencing. We used network analyses and cellular/process deconvolution of the transcriptome to identify important patho-physiological associations with outcome.\nFindings: Blood transcriptional profiles were obtained in 28 patients (21 HIV co-infected; median age 33 years [26-66]; median CSF WCC 28 cells/mm3 [0-3660]; median bacterial load 4.7x106 copies/ml CSF [671-2x109]; in-hospital mortality 64%), paired CSF profiles were obtained in 13. Marked differences in gene expression by outcome were confined to the CSF. In non-survivors, differentially expressed genes in the CSF were co-correlated in a network of pro-inflammatory gene-clusters enriched for collagen degradation and platelet degranulation. In contrast, CSF gene expression networks from surviving patients were dominated by DNA repair, transcriptional regulation and immunological signalling. CSF expression of gene response-modules for IL-17, Type 1 interferons and IL-10 were enriched in non-survivors, expression of cell-specific response-modules did not differ by outcome. However, genes for neutrophil chemotaxis and persistence were highly over-expressed in non-survivors.\nInterpretation: These data suggest poor outcome in PM is associated with over-expression of IL-17 and T1-IFN associated pro-inflammatory responses in the CSF and suggest a role for neutrophil-mediated inflammation. These responses are unlikely to be effected by current adjunctive treatments. Improving poor outcomes from PM will require better-targeted interventions.</p>",
  "id": "biorxiv.490045",
  "url": "https://www.biorxiv.org/content/early/2018/12/07/490045",
  "pdf": "https://www.biorxiv.org/content/biorxiv/early/2018/12/07/490045.full.pdf",
  "bibtex": "@article {Wall490045,\n  \tauthor = {Wall, Emma CB and Guerra-Assuncao, Jose Afonso and Pollara, Gabriele and Venturini, Cristina and Mlowzowa, Veronica and Allain, Theresa and Lalloo, David and Noursadeghi, Mahdad and Brown, Jeremy S and Heyderman, Robert},\n\ttitle = {Cerebrospinal fluid transcriptional analyses reveals upregulation of IL-17, Type 1 interferon transcriptional pathways and neutrophil persistence genes associated with increased mortality from pneumococcal meningitis in adults},\n\telocation-id = {490045},\n\tyear = {2018},\n\tdoi = {10.1101/490045},\n\tpublisher = {Cold Spring Harbor Laboratory},\n\tabstract = {Background: Improving outcomes from pneumococcal meningitis (PM), particularly in populations with high HIV prevalence, requires better understanding of host inflammatory responses to infection. Methods: We compared the transcriptome in pre-antibiotic cerebrospinal fluid (CSF) and blood from Malawian adults with PM using RNA sequencing. We used network analyses and cellular/process deconvolution of the transcriptome to identify important patho-physiological associations with outcome. Findings: Blood transcriptional profiles were obtained in 28 patients (21 HIV co-infected; median age 33 years [26-66]; median CSF WCC 28 cells/mm3 [0-3660]; median bacterial load 4.7x106 copies/ml CSF [671-2x109]; in-hospital mortality 64\\%), paired CSF profiles were obtained in 13. Marked differences in gene expression by outcome were confined to the CSF. In non-survivors, differentially expressed genes in the CSF were co-correlated in a network of pro-inflammatory gene-clusters enriched for collagen degradation and platelet degranulation. In contrast, CSF gene expression networks from surviving patients were dominated by DNA repair, transcriptional regulation and immunological signalling. CSF expression of gene response-modules for IL-17, Type 1 interferons and IL-10 were enriched in non-survivors, expression of cell-specific response-modules did not differ by outcome. However, genes for neutrophil chemotaxis and persistence were highly over-expressed in non-survivors. Interpretation: These data suggest poor outcome in PM is associated with over-expression of IL-17 and T1-IFN associated pro-inflammatory responses in the CSF and suggest a role for neutrophil-mediated inflammation. These responses are unlikely to be effected by current adjunctive treatments. Improving poor outcomes from PM will require better-targeted interventions.},\n\tURL = {https://www.biorxiv.org/content/early/2018/12/07/490045},\n\teprint = {https://www.biorxiv.org/content/early/2018/12/07/490045.full.pdf},\n\tjournal = {bioRxiv}\n}",
  "source": "biorxiv.org",
  "date": 1544217403,
  "tags": [],
  "doi": "10.1101/490045"
}